brew "zellij"

brew "helix"
brew "yaml-language-server"
brew "yamlfmt"
brew "go"

# dev tools
brew "go-task"
brew "lazygit"
brew "pre-commit"

# terraform
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

# k8s
cask "rancher"
brew "kustomize"
brew "k3d"
brew "k9s"
brew "tilt"

if OS.mac?
  cask "slack"
  tap "satrik/togglemute", "https://github.com/satrik/homebrew-togglemute.git"
  cask "togglemute", args: { no_quarantine: true }
end
